scripted_shopify_ruby/app/views/home/index.html.erb

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT 1  [["id", 1]]
---
            <script type="text/javascript">
                (function($) {
                    function displayNoReviewsYet() {
                        $(".reviews-progress").each(function() {
                            $(this).text("No reviews yet");
                        });
                    }

                    $(document).ready(function() {
                        var url = "\/\/apps.shopify.com\/c3d2dba94ec3418290391d03c77b1bae\/reviews.json";

                        $.ajax({
                            type: 'GET',
                            url: url,
                            dataType: 'json',
                            success: function(json) {
                                var rating = $("#rating-star-overall");

                                rating.find(".rating-star-halves").addClass('rating-star-halves-' + json.overall_rating);
                                rating.show();
                                $(".reviews-progress").hide();
